
Q1 List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

In [2]:
# 1) describe

data = { "name" : ["A","B","C","D"],
         "age" : [21,34,12,34]

}

df = pd.DataFrame(data)
df.describe()

             age
count   4.000000
mean   25.250000
std    10.750969
min    12.000000
25%    18.750000
50%    27.500000
75%    34.000000
max    34.000000

In [3]:
# 2) info

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [4]:
# 3) columns

df.columns

Index(['name', 'age'], dtype='object')

In [5]:
# 4) max
    
df.max()

name     D
age     34
dtype: object

In [6]:
# 5) head

df.head()

  name  age
0    A   21
1    B   34
2    C   12
3    D   34

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [7]:
data2 = { "A" : ["Aaaaaa","Bbbbbbbb","Cccccccc","efr","23243"],
         "B" :[1,2,3,3,3],
         "C" :[3,56,7,34,4],
         "D" :[34,34,345,4,4],
         "E" :[3,13,5,55,1]
}
df2 = pd.DataFrame(data2,index = pd.Series(list(range(1,(len(data2)*2)+1,2))))

In [8]:
df2

          A  B   C    D   E
1    Aaaaaa  1   3   34   3
3  Bbbbbbbb  2  56   34  13
5  Cccccccc  3   7  345   5
7       efr  3  34    4  55
9     23243  3   4    4   1

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [9]:
data3 = {"A" : [1,2,3,4,5],
         "Values": [10,20,30,40,50]
}


df3 = pd.DataFrame(data3)

In [10]:
result = 0

for index, row in df3.iterrows():
        
    if index <3 : 
        result = result + row['Values']
            
    else:
        break

            
print("The summation obtained is :",result)

The summation obtained is : 60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [11]:
data_text = {"Text" : ["asdfghj","wqefrgbg","sdafsfgre","dsafsgbt"]}

In [12]:
df = pd.DataFrame(data_text)

In [13]:
df["word_count"] = df["Text"].apply(lambda x: len(x))

In [14]:
df

        Text  word_count
0    asdfghj           7
1   wqefrgbg           8
2  sdafsfgre           9
3   dsafsgbt           8

Q5. How are DataFrame.size() and DataFrame.shape() different?

1)df.size
-->Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.

2)df.shape
-->Returns tuple of shape (Rows, columns) of dataframe/series

Q6. Which function of pandas do we use to read an excel file?

pd.read_excel()

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [15]:
email  = {"email" : ["abc@gmail.com","bbbasfd@gmail.com","harsh_isamalia@gmail.com"]}

In [16]:
df = pd.DataFrame(email)

In [17]:
df

                      email
0             abc@gmail.com
1         bbbasfd@gmail.com
2  harsh_isamalia@gmail.com

In [18]:
def user_name(x):
    
    for i in df.iteritems():
        
        
        df["username"].loc[df.index[i]] = df["email"].loc[df.index[i]]

In [19]:
df['username']  = df['email'].apply(lambda x : x.split("@")[0])

In [20]:
df

                      email        username
0             abc@gmail.com             abc
1         bbbasfd@gmail.com         bbbasfd
2  harsh_isamalia@gmail.com  harsh_isamalia

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [21]:
data = {"A":[3,8,6,2,9],
        "B":[5,2,9,3,1],
        "C":[1,7,4,5,2]
}

In [22]:
df = pd.DataFrame(data)

In [23]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [24]:
df['for_A'] = df['A'].apply(lambda x: x > 5)

def select_rows(x):
        
    for i in df.iterrows():
        
        d

df['for_B']  = df['B'].apply(lambda x: x<10)

In [25]:
df

   A  B  C  for_A  for_B
0  3  5  1  False   True
1  8  2  7   True   True
2  6  9  4   True   True
3  2  3  5  False   True
4  9  1  2   True   True

In [26]:
new_df = df[(df['for_A'] == True) & (df['for_B'] == True)]
new_df

   A  B  C  for_A  for_B
1  8  2  7   True   True
2  6  9  4   True   True
4  9  1  2   True   True

In [27]:
del new_df['for_A']
del new_df['for_B']

In [28]:
new_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [29]:
data = {"A" : [1,2,3,4,5],
         "Values": [10,20,30,40,50]
}


df = pd.DataFrame(data)

In [30]:
print("The mean of the Values column is :",df['Values'].mean())

The mean of the Values column is : 30.0

In [31]:
print("The median of the Values column is :",df['Values'].median())

The median of the Values column is : 30.0

In [32]:
print("The standard deviation of the Values column is :",df['Values'].std())

The standard deviation of the Values column is : 15.811388300841896

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [33]:

data = {
    "Sales" : [200,1200,30,1000,5200,1500,480],            
}
df = pd.DataFrame(data)

In [34]:
df['date'] = pd.date_range(start='03/11/2023', periods=len(df), freq='D')

In [35]:
df

   Sales       date
0    200 2023-03-11
1   1200 2023-03-12
2     30 2023-03-13
3   1000 2023-03-14
4   5200 2023-03-15
5   1500 2023-03-16
6    480 2023-03-17

In [36]:
def average(df,n):
    summation = 0
    
    for index,rows in df.iterrows():
        summation  = rows['Sales'] + summation
    avg = summation/7
    return avg
df['moving average']  = average(df,len(df))

In [37]:
df

   Sales       date  moving average
0    200 2023-03-11     1372.857143
1   1200 2023-03-12     1372.857143
2     30 2023-03-13     1372.857143
3   1000 2023-03-14     1372.857143
4   5200 2023-03-15     1372.857143
5   1500 2023-03-16     1372.857143
6    480 2023-03-17     1372.857143

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [38]:
data = {
    "Date" : pd.date_range(start='01/01/2023', periods=7, freq='D') 
}

In [39]:
df  = pd.DataFrame(data)

In [40]:
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
5 2023-01-06
6 2023-01-07

In [41]:
df['Weekdays']  = df['Date'].dt.day_name()

In [42]:
df

        Date   Weekdays
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday
5 2023-01-06     Friday
6 2023-01-07   Saturday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [43]:
data = {
    "Date" : pd.date_range(start='12/01/2022', periods=100, freq='D') 
}

df  = pd.DataFrame(data)

In [44]:
filtered_df = df.loc[(df['Date'] >= '2023-01-01')& (df['Date'] < '2023-01-31')]

In [45]:
filtered_df

         Date
31 2023-01-01
32 2023-01-02
33 2023-01-03
34 2023-01-04
35 2023-01-05
36 2023-01-06
37 2023-01-07
38 2023-01-08
39 2023-01-09
40 2023-01-10
41 2023-01-11
42 2023-01-12
43 2023-01-13
44 2023-01-14
45 2023-01-15
46 2023-01-16
47 2023-01-17
48 2023-01-18
49 2023-01-19
50 2023-01-20
51 2023-01-21
52 2023-01-22
53 2023-01-23
54 2023-01-24
55 2023-01-25
56 2023-01-26
57 2023-01-27
58 2023-01-28
59 2023-01-29
60 2023-01-30

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

--> The most important library is pandas iteself